new mermaid code for chellange 2
